import { appendFile, writeFile, mkdir } from 'node:fs';

const fileList = [
  // - **创建型** 设计模式:
  `简单工厂模式`,
  `工厂方法模式`,
  // `抽象工厂模式`,
  // `建造者模式`,
  // `原型模式`,
  // `单例模式`,
  // // - **结构型** 设计模式:
  // `外观模式`,
  // `适配器模式`,
  // `代理模式`,
  // `装饰器模式`,
  // `桥接模式`,
  // `组合模式`,
  // `享元模式`,
  // // - **行为型** 设计模式:
  // `模板方法模式`,
  // `观察者模式`,
  // `状态模式`,
  // `策略模式`,
  // `责任链模式`,
  // `命令模式`,
  // `访问者模式`,
  // `中介者模式`,
  // `备忘录模式`,
  // `迭代器模式`,
  // `解释器模式`,
  // // - **技巧型** 设计模式:
  // `链模式`,
  // `委托模式`,
  // `数据访问对象模式`,
  // `节流模式`,
  // `简单模板模式`,
  // `惰性模式`,
  // `参与者模式`,
  // `等待者模式`,
  // // - **架构型** 设计模式
  // `同步模块模式`,
  // `异步模块模式`,
  // `Widget 模式`,
  // `MVC 模式`,
  // `MVP 模式`,
  // `MVVM 模式`,
];

// mkdir('testDir', (err) => {});

for (const key in fileList) {
  console.log(`🚀 ~ file ${key + 1}. ${fileList[key]}`);
  const fileName = `${key}. ${fileList[key]}.js`;
  const comment = `/**
   * @${fileList[key]}
   */
  `;

  appendFile(fileName, comment, (err) => {}); // 无则创建,有则追加
  // writeFile(fileName, comment, (err) => {}); // 无则创建,有则覆盖
}
