#!/bin/bash
set -e

MONGODB_WORKSPACE=$WORKSPACE/mongodb

cd $PACKAGE_DIR
if [ -e $MONGODB_WORKSPACE ];then
       echo "清理已存在$MONGODB_WORKSPACE"	
	rm -rf $MONGODB_WORKSPACE
fi	

####################################################################################################################################

echo "[1]创建node工作空间"
mkdir -p $MONGODB_WORKSPACE

####################################################################################################################################

echo "[2]开始解压..."
tar -zxf ./mongodb.tar.gz -C $MONGODB_WORKSPACE

####################################################################################################################################

echo "[3]脚本结束"
